Tekla.Structures.ModelInternal.dotSetTemporaryStates_t
Struct for UI selection

Tekla.Structures.ModelInternal.dotSetTemporaryStates_t.State
FunctionalityEnum

Tekla.Structures.ModelInternal.dotSetTemporaryStates_t.Transparency
Transparency enum

Tekla.Structures.ModelInternal.dotSetTemporaryStates_t.nObjects
Number of objects

Tekla.Structures.ModelInternal.dotSetTemporaryStates_t.AllObjects
All objects

Tekla.Structures.ModelInternal.dotSetTemporaryStates_t.aObjectIDs
IDs

Tekla.Structures.ModelInternal.dotSetTemporaryStates_t.aObjectSubIDs
Sub IDs